Repository: OrDinaD/MyIIS
Catalog: MyIISWidget/Localizable.xcstrings
Source language: ru
Languages: be, en, uk

source: %@ — endpoint вернул ошибку
be: %@ — endpoint вярнуў памылку
en: %@ — endpoint returned an error
uk: %@ — endpoint повернув помилку

source: %@ — ошибка сервера
be: %@ — памылка сервера
en: %@ — server error
uk: %@ — помилка сервера

source: %@ — сервер не поддерживает HEAD
be: %@ — сервер не падтрымлівае HEAD
en: %@ — server does not support HEAD
uk: %@ — сервер не підтримує HEAD

source: %@ — требуется авторизация
be: %@ — патрабуецца аўтарызацыя
en: %@ — authorization required
uk: %@ — потрібна авторизація

source: === Доступность серверов БГУИР ===
be: === Даступнасць сервераў БДУІР ===
en: === BSUIR Server Availability ===
uk: === Доступність серверів БДУІР ===

source: === Ошибка ===
be: === Памылка ===
en: === Error ===
uk: === Помилка ===

source: === Рекомендация ===
be: === Рэкамендацыя ===
en: === Recommendation ===
uk: === Рекомендація ===

source: === Технические детали ===
be: === Тэхнічныя падрабязнасці ===
en: === Technical Details ===
uk: === Технічні подробиці ===

# intent_absences_response_format
source: Пропуски по неуважительной причине — %d ч.
be: Пропускі па непаважлівай прычыне — %d г.
en: Unexcused absences: %d hrs
uk: Пропуски з неповажної причини — %d год.

# intent_absences_title
source: Показать пропуски
be: Паказаць пропускі
en: Show absences
uk: Показати пропуски

# intent_absences_unavailable_dialog
source: Не удалось получить данные о пропусках. Сначала откройте MyIIS и обновите данные.
be: Не ўдалося атрымаць даныя пра пропускі. Спачатку адкрыйце MyIIS і абнавіце даныя.
en: Could not get absence data. Please open MyIIS and refresh data first.
uk: Не вдалося отримати дані про пропуски. Спочатку відкрийте MyIIS та оновіть дані.

# intent_absences_unavailable_short
source: Не удалось получить данные о пропусках.
be: Не ўдалося атрымаць даныя пра пропускі.
en: Could not get absence data.
uk: Не вдалося отримати дані про пропуски.

# intent_average_response_format
source: Средний балл — %@
be: Сярэдні бал — %@
en: Average score is %@
uk: Середній бал — %@

# intent_average_title
source: Показать средний балл
be: Паказаць сярэдні бал
en: Show average grade
uk: Показати середній бал

# intent_average_unavailable_dialog
source: Не удалось получить средний балл. Сначала откройте MyIIS и обновите данные.
be: Не ўдалося атрымаць сярэдні бал. Спачатку адкрыйце MyIIS і абнавіце даныя.
en: Could not get average grade. Please open MyIIS and refresh data first.
uk: Не вдалося отримати середній бал. Спочатку відкрийте MyIIS та оновіть дані.

# intent_average_unavailable_short
source: Не удалось получить средний балл.
be: Не ўдалося атрымаць сярэдні бал.
en: Could not get average grade.
uk: Не вдалося отримати середній бал.

# intent_group_response_format
source: Ваша группа — %@
be: Ваша група — %@
en: Your group is %@
uk: Ваша група — %@

# intent_group_title
source: Показать мою группу
be: Паказаць маю групу
en: Show my group
uk: Показати мою групу

# intent_group_unavailable_dialog
source: Номер группы не найден. Пожалуйста, авторизуйтесь в приложении.
be: Нумар групы не знойдзены. Калі ласка, аўтарызуйцеся ў праграме.
en: Group number not found. Please log in to the app.
uk: Номер групи не знайдено. Будь ласка, авторизуйтесь у застосунку.

# intent_group_unavailable_short
source: Номер группы не найден.
be: Нумар групы не знойдзены.
en: Group number not found.
uk: Номер групи не знайдено.

# intent_open_section_title
source: Открыть раздел в MyIIS
be: Адкрыць раздзел у MyIIS
en: Open section in MyIIS
uk: Відкрити розділ у MyIIS

# intent_section_attendance
source: Пропуски
be: Пропускі
en: Absences

# intent_section_diploma
source: Диплом
be: Дыплом
en: Diploma

# intent_section_dormitory
source: Общежитие
be: Інтэрнат
en: Dormitory
uk: Гуртожиток

# intent_section_gradebook
source: Зачётка
be: Залікоўка
en: Gradebook
uk: Заліковка

# intent_section_group
source: Группа
be: Група
en: Group
uk: Група

# intent_section_headman
source: Староста
be: Стараста
en: Headman

# intent_section_library
source: Библиотека
be: Бібліятэка
en: Library
uk: Бібліотека

# intent_section_parameter
source: Раздел
be: Раздзел
en: Section
uk: Розділ

# intent_section_profile
source: Профиль
be: Профіль
en: Profile
uk: Профіль

# intent_section_rating
source: Рейтинг
be: Рэйтынг
en: Rating

# intent_section_schedule
source: Расписание
be: Расклад
en: Schedule
uk: Розклад

# intent_section_services
source: Сервисы
be: Сэрвісы
en: Services
uk: Сервіси

# intent_section_study
source: Учёба
be: Вучоба
en: Study
uk: Навчання

# intent_section_type
source: Раздел MyIIS
be: Раздзел MyIIS
en: MyIIS Section
uk: Розділ MyIIS

# lesson_type_consultation
source: Консультация
be: Кансультацыя
en: Consultation
uk: Консультація

# lesson_type_exam
source: Экзамен / Зачёт
be: Іспыт / Залік
en: Exam / Credit
uk: Іспит / Залік

# lesson_type_laboratory
source: Лабораторная работа
be: Лабараторная праца
en: Laboratory
uk: Лабораторна робота

# lesson_type_lecture
source: Лекция
be: Лекцыя
en: Lecture
uk: Лекція

# lesson_type_other
source: Прочее / Мероприятие
be: Іншае / Мерапрыемства
en: Other / Event
uk: Інше / Захід

# lesson_type_practice
source: Практическое занятие
be: Практычны занятак
en: Practice
uk: Практичне заняття

# schedule_density_compact
source: Компактная
be: Кампактная
en: Compact
uk: Компактна

# schedule_other_subgroup_compact
source: Показывать компактно
be: Паказваць кампактна
en: Show compact
uk: Показувати компактно

# schedule_other_subgroup_full
source: Показывать полностью
be: Паказваць цалкам
en: Show fully
uk: Показувати повністю

# schedule_other_subgroup_hidden
source: Скрывать
be: Хаваць
en: Hide
uk: Ховати

# tab_attendance
source: Пропуски
be: Пропускі
en: Absences

# tab_profile
source: Профиль
be: Профіль
en: Profile
uk: Профіль

# tab_rating
source: Рейтинг
be: Рэйтынг
en: Rating

# tab_schedule
source: Расписание
be: Расклад
en: Schedule
uk: Розклад

# tab_services
source: Сервисы
be: Сэрвісы
en: Services
uk: Сервіси

source: Далее:
be: Далей:
en: Next:
uk: Далі:

source: Детали ошибки
be: Падрабязнасці памылкі
en: Error details
uk: Подробиці помилки

source: Доступен
be: Даступны
en: Available
uk: Доступний

source: Доступность серверов БГУИР
be: Даступнасць сервераў БДУІР
en: BSUIR Server Availability
uk: Доступність серверів БДУІР

source: Если ошибка повторяется: отключите VPN и попробуйте сеть eduroam.
be: Калі памылка паўтараецца, адключыце VPN і паспрабуйце сетку eduroam.
en: If the error persists: disconnect VPN and try eduroam network.
uk: Якщо помилка повторюється: вимкніть VPN та спробуйте мережу eduroam.

source: Закрыть
be: Закрыць
en: Close
uk: Закрити

source: Занятий нет
be: Заняткаў няма
en: No classes
uk: Занять немає

source: ИИС проверяется через рабочий API endpoint, остальные серверы — лёгким HEAD-запросом с timeout 8 секунд.
be: ІІС правяраецца праз працоўны API endpoint, астатнія серверы — лёгкім HEAD-запытам з тайм-аўтам 8 секунд.
en: IIS is checked via active API endpoint, other servers via lightweight HEAD request with 8s timeout.
uk: ІІС перевіряється через робочий API endpoint, інші сервери — швидким HEAD-запитом із тайм-аутом 8 секунд.

source: Код ошибки / Подробности:
be: Код памылкі / Падрабязнасці:
en: Error code / Details:
uk: Код помилки / Подробиці:

source: Моя группа
be: Мая група
en: My group
uk: Моя група

source: Навигация
be: Навігацыя
en: Navigation
uk: Навігація

source: Не удалось обновить данные
be: Не ўдалося абнавіць даныя
en: Failed to refresh data
uk: Не вдалося оновити дані

source: Недоступен
be: Недаступны
en: Unavailable
uk: Недоступний

source: Некорректный URL для проверки.
be: Некарэктны URL для праверкі.
en: Invalid URL for check.
uk: Некоректний URL для перевірки.

source: Нет HTTP-ответа
be: Няма HTTP-адказу
en: No HTTP response
uk: Немає HTTP-відповіді

source: Нет доступа
be: Няма доступу
en: No access
uk: Немає доступу

source: Обновить
be: Абнавіць
en: Refresh
uk: Оновити

source: Обновление данных
be: Абнаўленне даных
en: Updating data
uk: Оновлення даних

source: Объявление
be: Аб’ява
en: Announcement
uk: Оголошення

source: Отключить VPN и использовать сеть eduroam
be: Адключыць VPN і выкарыстоўваць сетку eduroam
en: Disconnect VPN and use eduroam
uk: Вимкнути VPN та використовувати мережу eduroam

source: Открыть раздел
be: Адкрыць раздзел
en: Open section
uk: Відкрити розділ

source: Ошибка API
be: Памылка API
en: API error
uk: Помилка API

source: Ошибка URL
be: Памылка URL
en: URL error
uk: Помилка URL

source: Ошибка:
be: Памылка:
en: Error:
uk: Помилка:

source: Портал БГУИР
be: Партал БДУІР
en: BSUIR Portal
uk: Портал БДУІР

source: Последняя проверка серверов:
be: Апошняя праверка сервераў:
en: Last server check:
uk: Остання перевірка серверів:

source: Проверка отменена
be: Праверка скасавана
en: Check cancelled
uk: Перевірку скасовано

source: Проверяем серверы...
be: Правяраем серверы...
en: Checking servers...
uk: Перевіряємо сервери...

source: Пропуски
be: Пропускі
en: Absences

source: Пропуски за
be: Пропускі за
en: Absences for

source: Рекомендации по сети
be: Рэкамендацыі па сетцы
en: Network recommendations
uk: Рекомендації щодо мережі

source: Рекомендуется отключить VPN и использовать сеть eduroam. Это снижает риск блокировки/таймаутов при доступе к сервисам БГУИР.
be: Рэкамендуецца адключыць VPN і выкарыстоўваць сетку eduroam. Гэта зніжае рызыку блакіроўкі і тайм-аўтаў пры доступе да сэрвісаў БДУІР.
en: We recommend disconnecting VPN and using eduroam network to reduce timeouts to BSUIR services.
uk: Рекомендується вимкнути VPN та використовувати мережу eduroam. Це знижує ризик блокування та таймаутів при доступі до сервісів БДУІР.

source: Сдача задолженностей, рецензирование
be: Здача запазычанасцей, рэцэнзаванне
en: Retake submissions, reviewing
uk: Здача заборгованостей, рецензування

source: СЕЙЧАС
be: ЗАРАЗ
en: NOW
uk: ЗАРАЗ

source: Сервер недоступен. Детали ниже.
be: Сервер недаступны. Падрабязнасці ніжэй.
en: Server unavailable. Details below.
uk: Сервер недоступний. Подробиці нижче.

source: Сервер ответил не-HTTP протоколом.
be: Сервер адказаў не праз HTTP-пратакол.
en: Server responded with non-HTTP protocol.
uk: Сервер відповів не через HTTP-протокол.

source: Скопировано
be: Скапіявана
en: Copied
uk: Скопійовано

source: Скопировать
be: Скапіяваць
en: Copy
uk: Скопіювати

source: Средний балл
be: Сярэдні бал
en: Grade point average
uk: Середній бал

source: Технические детали
be: Тэхнічныя падрабязнасці
en: Technical details
uk: Технічні подробиці

source: ч.
be: г.
en: hr
uk: год.

# gradebook_share_semester_format
source: %@ семестр
en: Semester %@

# schedule_density_regular
source: Стандартная
en: Regular
uk: Стандартна
